package com.cw.biz.sms.enums;

/**
 * @Title: ENUM_SMS_RESPOND
 * @Description: 短信返回状态码
 * @Author: Away
 * @Date: 2018/9/1 19:28
 */
public enum ENUM_SMS_RESPOND {
    M0("提交成功"),

    M101("无此用户"),

    M102("密码错"),

    M103("提交过快（提交速度超过流速限制）"),

    M104("系统忙（因平台侧原因，暂时无法处理提交的短信）"),

    M105("敏感短信（短信内容包含敏感词）"),

    M106("消息长度错（>536或<=0）"),

    M107("包含错误的手机号码"),

    M108("手机号码个数错（群发>1000或<=0）"),

    M109("无发送额度（该用户可用短信数已使用完）"),

    M110("不在发送时间内"),

    M113("扩展码格式错（非数字或者长度不对）"),

    M114("可用参数组个数错误（小于最小设定值或者大于 1000）;变量参数组大于 20个"),

    M116("签名不合法或未带签名（在更换自己的签名需要在平台上报备后方可使用该签名）"),

    M117("IP地址认证错,请求调用的IP地址不是系统登记的IP地址"),

    M118("用户没有相应的发送权限（账号被禁止发送）"),

    M119("用户已过期"),

    M120("违反防盗用策略(日发送限制)"),

    M123("发送类型错误"),

    M124("白模板匹配错误"),

    M125("匹配驳回模板，提交失败"),

    M127("定时发送时间格式错误"),

    M128("内容编码失败"),

    M129("JSON格式错误"),

    M130("请求参数错误（缺少必填参数）"),

    DELIVRD("短信发送成功"),

    UNKNOWN("未知短信状态"),

    REJECTD("短信被短信中心拒绝"),

    MBBLACK("目的号码是黑名单号码"),

    REJECT("审核驳回"),

    其他("网关内部状态");

    public final String msg;

    ENUM_SMS_RESPOND(String msg) {
        this.msg=msg;
    }

    public String getMessage(){
        return this.msg;
    }
}
